http://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html

https://www.google.com.tw/url?sa=t&rct=j&q=&esrc=s&source=web&cd=2&ved=2ahUKEwiIm8DBgpPgAhVFgLwKHbF9DAYQFjABegQIBRAB&url=https%3A%2F%2Fmedium.com%2F%40yehjames%2F%25E8%25B3%2587%25E6%2596%2599%25E5%2588%2586%25E6%259E%2590-%25E6%25A9%259F%25E5%2599%25A8%25E5%25AD%25B8%25E7%25BF%2592-%25E7%25AC%25AC2-3%25E8%25AC%259B-pandas-%25E5%259F%25BA%25E6%259C%25ACfunction%25E4%25BB%258B%25E7%25B4%25B9-series-dataframe-selection-grouping-447a3fa90b60&usg=AOvVaw1yormR4qv44vxuwnp01tzA

In [2]:
import pandas as pd
import numpy as np

用.Series創立一個一維表格

In [3]:
list = [12,23,34]
s = pd.Series(list)
print(s)

0    12
1    23
2    34
dtype: int64

.DateFrame做二維表格，可以在裡面標註columns, 和index的名稱，也可以反過來獲取兩者的名稱

In [4]:
a = np.array([[1,2,3], [4,5,6], [7,8,9]])
d = pd.DataFrame(a, columns = ['a','b','c'], index = ['g', 'h', 'j'])
print(d)

   a  b  c
g  1  2  3
h  4  5  6
j  7  8  9

In [5]:
d.columns

Index(['a', 'b', 'c'], dtype='object')

In [6]:
d.index

Index(['g', 'h', 'j'], dtype='object')

如果想把特定的columns照順序排列, 使用sort_values

In [7]:
r = pd.DataFrame(np.random.randint(0, 100, size=(5,5)), columns = ['a', 'b', 'c', 'd', 'e'])
print(r)

    a   b   c   d   e
0  37   5  29  39  19
1  88   1  73  67  55
2  81  77  13  99  90
3  46  50  60  78  94
4  68  11  30   5  83

產生一組亂數後，把b欄位照順序排列

In [8]:
r.sort_values('b')

    a   b   c   d   e
1  88   1  73  67  55
0  37   5  29  39  19
4  68  11  30   5  83
3  46  50  60  78  94
2  81  77  13  99  90

pd表格後可以接.head表示取頭幾個,tail表示後幾個,也可以不標示來取得全部數據。

In [9]:
r.head(3)

    a   b   c   d   e
0  37   5  29  39  19
1  88   1  73  67  55
2  81  77  13  99  90

In [68]:
r.tail(3)

    a   b   c   d   e
2  81  77  13  99  90
3  46  50  60  78  94
4  68  11  30   5  83

要取特定一欄也很簡單，就跟字典操作方法一樣。

In [10]:
r['c']

0    29
1    73
2    13
3    60
4    30
Name: c, dtype: int32

要取多筆欄位，將要顯示的欄位放在一個列表中。

In [11]:
list = ['b','d']
r[list]

    b   d
0   5  39
1   1  67
2  77  99
3  50  78
4  11   5

列表(index)範圍用冒號選取 [:]

In [12]:
r[1:4]

    a   b   c   d   e
1  88   1  73  67  55
2  81  77  13  99  90
3  46  50  60  78  94

針對特定欄位，做條件取捨。

In [13]:
choice_1 = r['b'] > 50
choice_2 = r['c'] <= 75
print(choice_1)
print(choice_2)

0    False
1    False
2     True
3    False
4    False
Name: b, dtype: bool
0    True
1    True
2    True
3    True
4    True
Name: c, dtype: bool

In [14]:
r[choice_1]

    a   b   c   d   e
2  81  77  13  99  90

In [15]:
r[choice_2]

    a   b   c   d   e
0  37   5  29  39  19
1  88   1  73  67  55
2  81  77  13  99  90
3  46  50  60  78  94
4  68  11  30   5  83

還有一些對欄位的簡單運算

In [16]:
r.sum()

a    320
b    144
c    205
d    288
e    341
dtype: int64

In [17]:
r.mean()

a    64.0
b    28.8
c    41.0
d    57.6
e    68.2
dtype: float64

groupby是照 某個columns來分組，被分類後再依後面的運算去執行。

In [53]:
F = pd.DataFrame({'A':[1, 2, 3, 4,5],
                  'B':['low', 'high', 'low', 'high', 'low'],
                  'C':['class_1', 'class_2', 'class_3', 'class_1', 'class_2']})

In [59]:
F.groupby('C').sum()

         A
C
class_1  5
class_2  7
class_3  3

In [66]:
F.groupby('B').sum()

      A
B
high  6
low   9

創造出一個連續的日期，用來放在columns或index

In [ ]:
dates = pd.date_range('20190101', periods = 10)
print(dates)

In [67]:
F.head()

   A     B        C
0  1   low  class_1
1  2  high  class_2
2  3   low  class_3
3  4  high  class_1
4  5   low  class_2

info(),和describe(), 提供詳細表格內資訊

In [61]:
d.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, g to j
Data columns (total 3 columns):
a    3 non-null int32
b    3 non-null int32
c    3 non-null int32
dtypes: int32(3)
memory usage: 48.0+ bytes

In [62]:
d.describe()

         a    b    c
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [ ]:
 [chr(i) for i in range(97,123)]